export const VACANCY_MOCK = {
  canEdit: false,
  is_closed: false,
  id: 46371595,
  id_client: 0,
  payment_from: 0,
  payment_to: 0,
  date_pub_to: 1686754523,
  date_archived: 0,
  date_published: 1684162523,
  address: 'Москва',
  profession: 'Solution Architect (Архитектор решений)',
  work: null,
  compensation: null,
  candidat:
    'Условия:\n\n• Нам требуется Solution architect с опытом разработки мироксервисной архитектуры в высоконагруженных решениях для разработки новой версии продукта на современном технологическом стеке. На нашем продукте ты, как архитектор, сможешь с нуля поднять и сопроводить крупное решение, которое будет распространяться в РФ, СНГ, Африке, Латинской Америке и Ближнем Востоке.\n• Официальное оформление по ТК РФ.\n• Конкурентная зарплата по итогам интервью, наличие премиальной составляющей.\n• ДМС.\n• Необходимая техника и софт для работы;\n• Методология разработки - SCRUM, масштабирования - LeSS.\n• Корпоративные мероприятия: корпоративы, внутренние лекции, командообразование, pizzaday и т.п.\n• Рассматриваем вариант удаленного сотрудничества в формате full time, либо формат работы в офисе в одном из городов присутствия (Москва, Красноярск, Белгород).\n\nТребования:\n\n• От 6 лет опыта работы в разработке заказного программного обеспечения.\n• От 2 лет опыта работы в роли техлида или архитектора.\n• Знание шаблонов проектирования (Enterprise, SOA, Microservices, EDA).\n• Понимание stateful и stateless приложений, микросервисной архитектуры;\n• Опыт с шинами данных (например, RabbitMQ, Kafka);\n• Опыт с SQL и NoSQL;\n• Опыт технологий контейнеризации и оркестрации - Docker, Kubernetes;\n• Опыт подготовки технической документации.\nОбязанности:\n\n• Подготовка проекта к разработке, в т.ч. финализация технологического стека.\n\n• Разработка архитектуры и архитектурных артефактов.\n\n• Архитектурный надзор и решение сложных технических задач вместе с командами.\n\n• Контроль проектной и технической документации на всем жизненном цикле продукта.\n\n• Консультация команд разработки по вопросам применения технического стека.\n• Поиск и документирование для команд наилучших практик применения технологий.\n• ode RevСiew.\n• Тренинги для команд по архитектурным приемам, лучшим практикам и т.п.',
  metro: [],
  currency: 'rub',
  vacancyRichText:
    '<br /><br /><b>Условия:</b><br /><ul><li>Нам требуется Solution architect с опытом разработки мироксервисной архитектуры в высоконагруженных решениях для разработки новой версии продукта на современном технологическом стеке. На нашем продукте ты, как архитектор, сможешь с нуля поднять и сопроводить крупное решение, которое будет распространяться в РФ, СНГ, Африке, Латинской Америке и Ближнем Востоке.<ul><li>Официальное оформление по ТК РФ.</li><li>Конкурентная зарплата по итогам интервью, наличие премиальной составляющей.</li><li>ДМС.</li><li>Необходимая техника и софт для работы;</li><li>Методология разработки - SCRUM, масштабирования - LeSS.</li><li>Корпоративные мероприятия: корпоративы, внутренние лекции, командообразование, pizzaday и т.п.</li></ul></li><li>Рассматриваем вариант удаленного сотрудничества в формате full time, либо формат работы в офисе в одном из городов присутствия (Москва, Красноярск, Белгород).<br /></li></ul><b>Требования:</b><br /><ul><li>От 6 лет опыта работы в разработке заказного программного обеспечения.<ul><li>От 2 лет опыта работы в роли техлида или архитектора.</li><li>Знание шаблонов проектирования (Enterprise, SOA, Microservices, EDA).</li><li>Понимание stateful и stateless приложений, микросервисной архитектуры;</li><li>Опыт с шинами данных (например, RabbitMQ, Kafka);</li><li>Опыт с SQL и NoSQL;</li><li>Опыт технологий контейнеризации и оркестрации - Docker, Kubernetes;</li><li>Опыт подготовки технической документации.</li></ul></li></ul><b>Обязанности:</b><br /><ul><li>Подготовка проекта к разработке, в т.ч. финализация технологического стека.<br /></li><li>Разработка архитектуры и архитектурных артефактов.<br /></li><li>Архитектурный надзор и решение сложных технических задач вместе с командами.<br /></li><li>Контроль проектной и технической документации на всем жизненном цикле продукта.<br /></li><li>Консультация команд разработки по вопросам применения технического стека.</li><li>Поиск и документирование для команд наилучших практик применения технологий.</li><li>ode RevСiew.</li><li>Тренинги для команд по архитектурным приемам, лучшим практикам и т.п.</li></ul>',
  covid_vaccination_requirement: {
    id: 1,
    title: 'Не важно',
  },
  contact: 'Гершанович Светлана',
  moveable: false,
  agreement: true,
  anonymous: true,
  is_archive: false,
  is_storage: false,
  type_of_work: {
    id: 6,
    title: 'Полный рабочий день',
  },
  place_of_work: {
    id: 2,
    title: 'Удалённая работа (на дому)',
  },
  education: {
    id: 2,
    title: 'Высшее',
  },
  experience: {
    id: 4,
    title: 'От 6 лет',
  },
  maritalstatus: {
    id: 0,
    title: 'Не имеет значения',
  },
  children: {
    id: 0,
    title: 'Не имеет значения',
  },
  client: {
    industry: [],
  },
  languages: [],
  driving_licence: [],
  catalogues: [
    {
      id: 33,
      title: 'IT, Интернет, связь, телеком',
      key: 33,
      positions: [
        {
          id: 48,
          title: 'Разработка, программирование',
          key: 48,
        },
        {
          id: 49,
          title: 'Сетевые технологии',
          key: 49,
        },
        {
          id: 50,
          title: 'Системная интеграция',
          key: 50,
        },
        {
          id: 60,
          title: 'Другое',
          key: 60,
        },
        {
          id: 503,
          title: 'Внедрение и сопровождение ПО',
          key: 503,
        },
      ],
    },
  ],
  agency: {
    id: 2,
    title: 'кадровое агентство',
  },
  town: {
    id: 4,
    title: 'Москва',
    declension: 'в Москве',
    hasMetro: true,
    genitive: 'Москвы',
  },
  already_sent_on_vacancy: false,
  rejected: false,
  response_info: [],
  phone: '+7 (499) 3906000 доб. 7070',
  phones: [
    {
      number: 74993906000,
      additionalNumber: 7070,
    },
  ],
  fax: null,
  faxes: null,
  favorite: false,
  client_logo: null,
  highlight: false,
  age_from: 0,
  age_to: 0,
  gender: {
    id: 0,
    title: 'Не имеет значения',
  },
  firm_name: 'РТ-Инжиниринг',
  firm_activity:
    'РТ-ИНЖИНИРИНГ — НАЦИОНАЛЬНЫЙ ЕРС (М)-ПОДРЯДЧИК Выступает системным интегратором и поставщиком комплексных решений для недропользователей как в России, так и за рубежом. РТ-Инжиниринг использует накопленный опыт, знания и компетенции своих дочерних предприятий, крупнейших производственных и строительных компаний-партнеров, а также применяет лучшие инжиниринговые решения и передовые международные технологии. Это позволяет оказывать полный комплекс услуг: от исследований до строительства предприятий «под ключ».',
  link: 'https://www.superjob.ru/vakansii/solution-architect-46371595.html',
  isBlacklisted: false,
  latitude: 55.75322,
  longitude: 37.622513,
};
